src/app/controllers/application_controller.rb

    def redirect_if_not_washer
        unless user_signed_in? && current_user.roles.include?(Role.find_by(name: 'washer'))
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "washer"], ["LIMIT", 1]]
SELECT  1 AS one FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 AND "roles"."id" = $2 LIMIT $3  [["user_id", 28], ["id", 2], ["LIMIT", 1]]