src/app/controllers/cars_controller.rb

    def verify_editable
        return if current_user.admin || current_user.owns_car?(Car.find(params[:id]))
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]