src/app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "make", "rego", "owner_id", "created_at", "updated_at", "suburb") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", ""], ["make", ""], ["rego", ""], ["owner_id", 30], ["created_at", "2019-11-12 02:11:36.045983"], ["updated_at", "2019-11-12 02:11:36.045983"], ["suburb", ""]]
---
  def create
    current_user.cars.create(car_params)